ying locoy project hs_s_trade_EM

Steps:
1. change hs_s_trade_EM
2. change labels by replacing one by one.
	2.1 note: step 2 and step 3 can be done at the same time to save time
3. create table and setup mysql procedure
	3.1 note: add unique statement: UNIQUE KEY `UniqueKeyName` (``,``,``)
	3.2 note: change the data type of each field & change the length of VARCHAR
	3.3 note: for each field of the table, make a good comment including a standardized and consistant field, and the original label in the datasource. 
4. setup locoy project: 192.168.137.172 gxh locoy ying
	4.1 数据库地址：C:\火车采集器V8\Data\（*）\SpiderResult.db3
5. test
	5.1 note: test with a few records
	
网页: http://quote.eastmoney.com/f1.html?code=601318&market=1 
数据: http://hqdigi2.eastmoney.com/EM_Quote2010NumericApplication/CompatiblePage.aspx?Type=OB&stk=6013181&Reference=xml&limit=0&page=1& 所有成交(第一页）;  http://hqdigi2.eastmoney.com/EM_Quote2010NumericApplication/CompatiblePage.aspx?Type=OB&stk=6013181&Reference=xml&limit=10000&page=1& 成交量大于10000手的;

var jsTimeSharingData={pages:[参数],data:["09:19:34,30.00,0,0";

"[参数],[参数],[参数],[参数]","09:40:44,29.93,20576,0","09:41:20,29.85,23213,-1"


[参数]
[参数1]: code &stk=6013181& &stk=[参数]& 从网址中提取 SUBSTRING(code FROM 1 FOR 6)
[参数2]: time 
[参数3]: trade
[参数4]: volume
[参数5]: pan 1为买盘（外盘），-1为卖盘（内盘），0为中性盘
[参数]:DateSys;

SELECT * FROM `ying`.`hs_s_trade_EM`;	
DROP TABLE `ying`.`hs_s_trade_EM`;
CREATE TABLE `hs_s_trade_EM` (
  `id` mediumint(8) unsigned NOT NULL AUTO_INCREMENT,
  `code` VARCHAR(6) DEFAULT NULL COMMENT 'code',
  `time` time DEFAULT NULL COMMENT 'time',
  `trade` decimal(6,2) unsigned DEFAULT NULL COMMENT 'trade',
  `volume` mediumint(6) unsigned DEFAULT NULL COMMENT 'volume',
  `pan` tinyint(1) unsigned DEFAULT NULL COMMENT 'pan',
  `DateSys` DATE DEFAULT NULL COMMENT 'DateSystem',
  PRIMARY KEY (`id`),
  UNIQUE KEY `KeyName` (`code`,`time`,`DateSys`)
) ENGINE=InnoDB AUTO_INCREMENT=1 DEFAULT CHARSET=utf8;

DROP PROCEDURE `ying`.`hs_s_trade_EM`;
DELIMITER $$
CREATE DEFINER=`gxh`@`%` PROCEDURE `hs_s_trade_EM`(IN code VARCHAR(18), time VARCHAR(18), trade VARCHAR(18), volume VARCHAR(18), pan VARCHAR(18), DateSys DATE)
BEGIN
SET code = IF(code = '', NULL, SUBSTRING(code FROM 1 FOR 6));
SET time = IF(time = '', NULL, time);
SET trade = IF(trade = '', NULL, trade);
SET volume = IF(volume = '', NULL, volume);
SET pan = IF(pan = '', NULL, pan);
SET DateSys = DateSys;

INSERT INTO `hs_s_trade_EM` (`code`, `time`, `trade`, `volume`, `pan`, `DateSys`) VALUES (code, time, trade, volume, pan, DateSys) 
ON DUPLICATE KEY UPDate 
`code` = IF(code IS NULL, `code`, code),
`time` = IF(time IS NULL, `time`, time),
`trade` = IF(trade IS NULL, `trade`, trade),
`volume` = IF(volume IS NULL, `volume`, volume),
`pan` = IF(pan IS NULL, `pan`, pan),
`DateSys` = DateSys;
END$$
DELIMITER ;

CALL hs_s_trade_EM('[标签:code]','[标签:time]','[标签:trade]','[标签:volume]','[标签:pan]','[系统时间转化:yyyy-MM-dd]')

original field name		name of gxh		Chinese
zjl                     zjl             (折价率：(净值-价格)/净值) 
code					code			证券代码
symbol					code			证券代码
trade					price			成交价
pricechange				chgprice		成交价涨跌		`chgprice` decimal(6,3) DEFAULT NULL COMMENT 'chgprice',
changepercent			chgrate			成交价涨跌幅	`chgrate` decimal(5,3) DEFAULT NULL COMMENT 'chgrate',
settlement				settlement		昨日成交价
buy						buy				买入价
sell					sell			卖出价
open					open			开盘价
high					high			最高价
low						low				最低价
volume					volume			成交量
amount					amount			成交额
ticktime				ticktime（time）		当时时间
per						per				市盈率
pb						pb				市净率
mktcap					mktcap			总股本
nmc						nmc				流通股本
turnoverratio			tRatio			换手率
WEIGHING				weight			权重
INAME					iName			指数名称
HYSYMBOL				iCode			指数代码	
ltgb					nmc				流通股本
zgb						mktcap			总股本
prevtrade				last			昨收盘
gxzs					gxzs			贡献指数
ltsz					ltsz			流通市值
netamount				netAmount		净流入
ratioamount				netRate			净流入率
r0						amountXL		特大单流入额 超大单流入
r1						amountL		    大单流入额 大单流入
r2						amountS			小单流入额 中单流入
r3						amountI			散单流入额(I: individual) 小单流入
r0_net					netXL			特大单净流入 超大单净流入
r1_net					netL		    大单净流入 
r2_net					netS			小单净流入 中单净流入
r3_net					netI			散单净流入(I: individual) 小单净流入
turnover				amount			换手率*100
r0x_ratio				ratioXL			主力罗盘度
						WeiBi			委比
						LiangBi			量比
						LiangBi			5分钟涨跌


var jsTimeSharingData={pages:5,data:["09:19:19,30.00,0,0","09:19:49,29.50,0,0","09:21:29,29.80,0,0","09:24:35,29.75,0,0","09:25:10,29.50,98515,-1","09:30:27,29.60,101101,1","09:30:57,29.52,68461,-1","09:31:32,29.50,44963,-1","09:31:57,29.50,32152,1","09:32:17,29.53,22812,0","09:32:42,29.74,8648,1","09:33:07,29.80,19862,1","09:33:48,29.94,44547,1","09:34:08,29.98,26525,1","09:34:33,29.90,28766,-1","09:34:53,29.89,11195,-1","09:35:33,29.86,29151,-1","09:36:03,29.90,16702,1","09:36:43,29.80,20124,-1","09:37:13,29.69,24277,-1","09:37:29,29.67,10342,-1","09:37:59,29.62,17365,-1","09:38:29,29.70,12683,1","09:38:54,29.80,6745,1","09:39:39,29.91,17416,1","09:39:59,29.93,13193,1","09:40:19,29.99,9768,1","09:40:44,29.93,20576,0","09:41:20,29.85,23213,-1","09:41:30,29.84,3363,0","09:41:55,29.80,10369,-1","09:42:15,29.85,6764,1","09:42:45,29.89,3925,1","09:43:05,29.95,5945,1","09:43:20,29.98,2710,1","09:43:45,29.99,16283,1","09:44:05,30.08,5450,1","09:44:25,30.15,5424,1","09:44:47,30.20,10260,1","09:45:02,30.27,8885,1","09:45:17,30.26,8377,-1","09:45:32,30.27,9073,-1","09:46:37,30.35,58525,1","09:46:52,30.35,9190,1","09:47:02,30.38,11473,1","09:47:17,30.30,10841,-1","09:47:37,30.21,7593,-1","09:47:52,30.15,5131,-1","09:48:08,30.10,4829,-1","09:48:23,30.15,2545,1","09:48:33,30.12,6923,0","09:48:53,30.17,4667,1","09:49:13,30.10,10106,-1","09:49:28,30.17,4147,1","09:49:53,30.10,8880,-1","09:50:08,30.10,6618,1","09:50:23,30.12,5950,0","09:50:38,30.08,5555,-1","09:51:53,30.13,30608,1","09:52:13,30.17,4496,1","09:52:23,30.12,1642,-1","09:52:38,30.12,4017,-1","09:52:58,30.12,14459,1","09:53:13,30.10,4720,-1","09:53:28,30.00,12751,-1","09:53:44,30.00,7555,-1","09:53:59,29.91,13791,-1","09:54:24,29.84,9142,-1","09:54:39,29.90,5319,1","09:54:54,29.91,2826,1","09:55:09,29.94,3046,1","09:55:24,29.95,3582,1","09:55:39,29.95,7414,-1","09:56:04,30.00,7099,1","09:56:24,30.03,4077,1","09:56:34,30.00,3672,-1","09:56:54,30.03,4447,1","09:57:24,30.05,7111,1","09:57:39,30.03,4874,-1","09:57:54,30.00,3863,-1","09:58:09,29.99,2368,-1","09:58:29,29.96,3748,-1","09:58:44,29.95,3107,-1","09:59:04,29.94,4696,-1","09:59:19,29.93,3641,0","09:59:34,29.95,2659,1","10:00:05,29.91,10096,-1","10:00:25,29.95,7845,1","10:00:40,29.88,3115,-1","10:00:55,29.90,3327,1","10:01:35,29.93,7247,0","10:01:45,29.93,2268,1","10:02:05,29.97,3054,1","10:02:35,29.95,3537,-1","10:02:50,29.95,1872,1","10:03:09,29.99,5726,1","10:03:24,29.98,3653,0","10:03:54,29.99,5247,1","10:04:09,30.00,3393,1","10:04:39,29.99,4147,-1","10:04:49,30.00,1002,1","10:05:04,30.00,1614,-1","10:05:19,30.05,3948,1","10:05:39,30.07,4641,1","10:06:59,30.15,14026,1","10:07:14,30.18,1775,1","10:07:24,30.16,2431,-1","10:07:44,30.16,3410,-1","10:07:49,30.17,1302,1","10:08:04,30.16,4730,0","10:08:19,30.16,2870,1","10:08:29,30.15,337,1","10:08:44,30.15,1530,1","10:08:54,30.16,883,1","10:09:04,30.15,1282,-1","10:09:19,30.15,1889,1","10:09:29,30.02,6870,-1","10:09:39,30.10,639,1","10:09:49,30.01,1233,-1","10:09:59,30.02,722,1","10:10:19,30.02,1425,1","10:10:29,30.06,1173,1","10:10:39,30.07,963,0","10:10:54,30.08,1700,1","10:11:10,30.15,1557,1","10:11:15,30.11,606,-1","10:11:30,30.19,4964,1","10:11:40,30.11,1558,-1","10:11:50,30.16,1726,1","10:12:00,30.18,516,1","10:12:15,30.15,671,0","10:12:30,30.17,2656,1","10:12:45,30.16,1068,-1","10:12:55,30.18,771,1","10:13:05,30.20,1303,1","10:13:20,30.19,1348,0","10:13:25,30.19,2300,-1","10:13:40,30.19,1799,1","10:13:50,30.19,181,-1","10:13:55,30.20,213,1","10:14:20,30.20,384,1","10:14:30,30.19,3561,-1","10:14:40,30.15,3063,-1","10:14:45,30.12,551,-1","10:15:00,30.10,667,-1","10:15:15,30.03,3919,-1","10:15:35,30.05,386,1","10:15:40,30.05,3821,1","10:16:25,30.06,6908,0","10:16:35,30.08,1704,1","10:16:45,30.04,882,-1","10:17:00,30.05,891,0","10:17:15,30.05,1065,1","10:17:25,30.04,1837,-1","10:17:40,30.06,1493,0","10:17:45,30.07,1235,1","10:18:05,30.08,1733,1","10:18:30,30.13,3220,1","10:18:45,30.13,367,-1","10:18:50,30.18,1269,1","10:19:05,30.15,799,-1","10:19:35,30.15,5127,-1","10:20:05,30.15,3518,-1","10:20:15,30.13,1467,-1","10:20:30,30.10,2828,-1","10:20:40,30.08,3421,-1","10:21:15,30.08,3438,1","10:21:25,30.09,1740,1","10:21:40,30.06,1270,-1","10:21:45,30.06,1632,-1","10:22:05,30.08,1349,0","10:22:11,30.06,3221,-1","10:22:21,30.06,4032,-1","10:22:36,30.03,1516,-1","10:22:51,30.02,2616,-1","10:22:56,30.02,2504,-1","10:23:11,29.97,14175,-1","10:23:26,29.89,6712,-1","10:23:46,29.87,7027,-1","10:24:01,29.88,1882,0","10:24:11,29.88,326,-1","10:24:26,29.90,2748,0","10:24:41,29.96,3397,1","10:24:51,29.98,888,1","10:25:01,29.96,295,-1","10:25:11,29.96,708,1","10:25:16,29.96,675,1","10:25:36,29.97,983,1","10:25:46,29.95,354,-1","10:25:51,29.97,1077,1","10:26:06,29.98,5663,1","10:26:16,30.00,5787,1","10:26:26,30.01,115,1","10:26:36,30.02,1039,1","10:26:41,30.01,396,-1","10:26:56,30.03,1075,1","10:27:11,30.05,1253,0","10:27:21,30.07,82,1","10:27:31,30.08,1505,1","10:27:51,30.07,2611,0"]};